app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "documents" WHERE "documents"."user_id" = $1  [["user_id", 1]]
INSERT INTO "documents" ("name", "user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "1_untitled_0"], ["user_id", 1], ["content", ""], ["created_at", "2020-04-02 18:53:47.168850"], ["updated_at", "2020-04-02 18:53:47.168850"]]
---
  def new
   #default: render index
    @count = Document.where(user_id: params[:user_id]).size
    current_time = Time.now
    @document = Document.create!(:name => params[:user_id] + '_untitled_' + @count.to_s,
      :user_id => params[:user_id].to_i,
      :created_at => current_time,
      :updated_at => current_time)

SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = $1  ORDER BY "documents"."name" ASC  [["user_id", 2]]
---
  def show
    @programming_languages = [['Select Lang','c_cpp'], ['C','c_cpp'], ['C++','c_cpp'], ['CSS','css'], ['Go','golang'], ['HAML','haml'], ['HTML','html'], ['Java','java'], ['Javascript','javascript'], ['JSON','json'], ['MySql','mysql'], ['Python','python'], ['Ruby','ruby']]
    @theme = [['Select Theme','ambiance'], ['Ambiance','ambiance'], ['Chaos','chaos'], ['Dracula','dracula'], ['Cobalt','cobalt'], ['Terminal','terminal'], ['Twilight','twilight'], ['Monokai','monokai'], ['Chrome','chrome'], ['Dawn','dawn'], ['Github','github'], ['Xcode','xcode'],]
    @font_size = [['Font Size', 12], ['12', 12], ['14', 14], ['16', 16], ['18', 18], ['20', 20], ['40', 40], ['80', 80]]
    @document ||= Document.find(params[:id])
    @document_list = []
    document = Document.where(user_id: @document.user_id)
    @doc_name = @document.name
    document.each do |doc|

SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT 1  [["id", 85]]
UPDATE "documents" SET "content" = $1, "updated_at" = $2 WHERE "documents"."id" = $3  [["content", "1"], ["updated_at", "2020-04-02 19:17:29.624127"], ["id", 11]]
---
  def update
    #params['content'] to get content
    @document ||= Document.find(params[:id])
    if @document
        @document.update(content: params['content'], updated_at: Time.now)

SELECT  "documents".* FROM "documents" WHERE "documents"."name" = $1 LIMIT 1  [["name", "1_untitled_32"]]
UPDATE "documents" SET "name" = $1, "updated_at" = $2 WHERE "documents"."id" = $3  [["name", "1_untitled_322"], ["updated_at", "2020-04-02 20:43:26.702422"], ["id", 33]]
---
  def edit_doc_name
    doc = Document.find_by(name: params['old_doc_name'])
    if doc
        if Document.find_by(name: params['new_doc_name'])
            respond_to do |format|
              msg = { :status => "err", :message => "file name exist!"}
              format.json { render json: msg }
            end
        else
            doc.update(name: params['new_doc_name'], updated_at: Time.now)

SELECT  "documents".* FROM "documents" WHERE "documents"."name" = $1 LIMIT 1  [["name", "2_untitled_17"]]
---
  def change_doc
    doc = Document.find_by(name: params['file_name'])