app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = $1  ORDER BY "documents"."name" ASC  [["user_id", 2]]
SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = $1  [["user_id", 2]]
---
	def create
		@user = User.find_or_create_with_omniauth(request.env['omniauth.auth'])
		session[:user_id] = @user.id
		@document_list = [['Select File', '']]
    		document = Document.where(user_id: session[:user_id]).order(:name)
    		document.each do |doc|