app/controllers/ultimatecode_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = $1  ORDER BY "documents"."name" ASC  [["user_id", 2]]
SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = $1  ORDER BY "documents"."id" ASC  [["user_id", 1]]
---
  def index
   #default: render index
    @document_list = []
    document = Document.where(user_id: session[:user_id]).order(:name)
    document.each do |doc|